# LiningThicknessIsLargeForDiameter Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MechanicalFailures..::..LiningThicknessIsLargeForDiameter Property
BuiltInFailures..::..MechanicalFailures Class See Also
---
Lining Thickness ([Lining Thickness Value]) is too large for current Diameter ([Diameter Value]).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LiningThicknessIsLargeForDiameter { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LiningThicknessIsLargeForDiameter As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LiningThicknessIsLargeForDiameter {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MechanicalFailures Class
Autodesk.Revit.DB Namespace